weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND1 */
#define IFX_CAN_N_NDAT1_ND1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND1 */
#define IFX_CAN_N_NDAT1_ND1_OFF (1u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND2 */
#define IFX_CAN_N_NDAT1_ND2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND2 */
#define IFX_CAN_N_NDAT1_ND2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND2 */
#define IFX_CAN_N_NDAT1_ND2_OFF (2u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND3 */
#define IFX_CAN_N_NDAT1_ND3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND3 */
#define IFX_CAN_N_NDAT1_ND3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND3 */
#define IFX_CAN_N_NDAT1_ND3_OFF (3u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND4 */
#define IFX_CAN_N_NDAT1_ND4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND4 */
#define IFX_CAN_N_NDAT1_ND4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND4 */
#define IFX_CAN_N_NDAT1_ND4_OFF (4u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND5 */
#define IFX_CAN_N_NDAT1_ND5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND5 */
#define IFX_CAN_N_NDAT1_ND5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND5 */
#define IFX_CAN_N_NDAT1_ND5_OFF (5u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND6 */
#define IFX_CAN_N_NDAT1_ND6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND6 */
#define IFX_CAN_N_NDAT1_ND6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND6 */
#define IFX_CAN_N_NDAT1_ND6_OFF (6u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND7 */
#define IFX_CAN_N_NDAT1_ND7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND7 */
#define IFX_CAN_N_NDAT1_ND7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND7 */
#define IFX_CAN_N_NDAT1_ND7_OFF (7u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND8 */
#define IFX_CAN_N_NDAT1_ND8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND8 */
#define IFX_CAN_N_NDAT1_ND8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND8 */
#define IFX_CAN_N_NDAT1_ND8_OFF (8u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND9 */
#define IFX_CAN_N_NDAT1_ND9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND9 */
#define IFX_CAN_N_NDAT1_ND9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND9 */
#define IFX_CAN_N_NDAT1_ND9_OFF (9u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND10 */
#define IFX_CAN_N_NDAT1_ND10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND10 */
#define IFX_CAN_N_NDAT1_ND10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND10 */
#define IFX_CAN_N_NDAT1_ND10_OFF (10u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND11 */
#define IFX_CAN_N_NDAT1_ND11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND11 */
#define IFX_CAN_N_NDAT1_ND11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND11 */
#define IFX_CAN_N_NDAT1_ND11_OFF (11u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND12 */
#define IFX_CAN_N_NDAT1_ND12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND12 */
#define IFX_CAN_N_NDAT1_ND12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND12 */
#define IFX_CAN_N_NDAT1_ND12_OFF (12u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND13 */
#define IFX_CAN_N_NDAT1_ND13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND13 */
#define IFX_CAN_N_NDAT1_ND13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND13 */
#define IFX_CAN_N_NDAT1_ND13_OFF (13u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND14 */
#define IFX_CAN_N_NDAT1_ND14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND14 */
#define IFX_CAN_N_NDAT1_ND14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND14 */
#define IFX_CAN_N_NDAT1_ND14_OFF (14u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND15 */
#define IFX_CAN_N_NDAT1_ND15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND15 */
#define IFX_CAN_N_NDAT1_ND15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND15 */
#define IFX_CAN_N_NDAT1_ND15_OFF (15u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND16 */
#define IFX_CAN_N_NDAT1_ND16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND16 */
#define IFX_CAN_N_NDAT1_ND16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND16 */
#define IFX_CAN_N_NDAT1_ND16_OFF (16u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND17 */
#define IFX_CAN_N_NDAT1_ND17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND17 */
#define IFX_CAN_N_NDAT1_ND17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND17 */
#define IFX_CAN_N_NDAT1_ND17_OFF (17u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND18 */
#define IFX_CAN_N_NDAT1_ND18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND18 */
#define IFX_CAN_N_NDAT1_ND18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND18 */
#define IFX_CAN_N_NDAT1_ND18_OFF (18u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND19 */
#define IFX_CAN_N_NDAT1_ND19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND19 */
#define IFX_CAN_N_NDAT1_ND19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND19 */
#define IFX_CAN_N_NDAT1_ND19_OFF (19u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND20 */
#define IFX_CAN_N_NDAT1_ND20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND20 */
#define IFX_CAN_N_NDAT1_ND20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND20 */
#define IFX_CAN_N_NDAT1_ND20_OFF (20u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND21 */
#define IFX_CAN_N_NDAT1_ND21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND21 */
#define IFX_CAN_N_NDAT1_ND21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND21 */
#define IFX_CAN_N_NDAT1_ND21_OFF (21u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND22 */
#define IFX_CAN_N_NDAT1_ND22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND22 */
#define IFX_CAN_N_NDAT1_ND22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND22 */
#define IFX_CAN_N_NDAT1_ND22_OFF (22u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND23 */
#define IFX_CAN_N_NDAT1_ND23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND23 */
#define IFX_CAN_N_NDAT1_ND23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND23 */
#define IFX_CAN_N_NDAT1_ND23_OFF (23u)

